cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

cask "firefox"
cask "google-chrome"
cask "spectacle"
cask "slack"
cask "flux"
cask "karabiner-elements"
cask "alfred" # still requires authentication
cask "adobe-acrobat-reader"
cask "vlc"
cask "1password"

# brew cask install dev tools
cask "iterm2" # hacker shit
cask "docker" # whales
cask "visual-studio-code" # the best editor
cask "dbeaver-community" # open source sql front end
cask "google-cloud-sdk" # corporate shit
cask "anaconda"
cask "quip"
cask "coda"
cask "signal"
cask "logitech-options"

# brew normal installs
brew "git"
brew "vim"
brew "wget"
brew "htop"
brew "fish"
brew "bash-git-prompt"
brew "bash-completion"
brew "unixodbc"
brew "awscli"
brew "terraform"
brew "starship"
