cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

cask "firefox"
cask "google-chrome"
cask "rectangle"
cask "slack"
cask "karabiner-elements"
cask "alfred"
cask "1password"
cask "signal"
cask "quip"

# brew cask install dev tools
cask "iterm2"
cask "docker"
cask "visual-studio-code"
# cask "anaconda"

# brew normal installs
brew "git"
brew "vim"
brew "wget"
brew "htop"
brew "fish"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "bash-git-prompt"
brew "bash-completion"
brew "unixodbc"
brew "awscli"
brew "terraform"
brew "starship"
