cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"

cask "firefox"
cask "google-chrome"
cask "brave-browser"
cask "rectangle"
cask "slack"
cask "spotify"
cask "karabiner-elements"
cask "alfred"
cask "1password"
cask "1password-cli"
cask "signal"
cask "quip"
cask "zoom"

# brew cask install dev tools
cask "iterm2"
cask "docker"
cask "visual-studio-code"
cask "font-hack-nerd-font"

# brew normal installs
brew "awscli"
brew "fish"
brew "git"
brew "htop"
brew "httpie"
brew "node"
brew "nvm"
brew "make"
brew "openssl"
brew "pyenv"
brew "pyenv-virtualenv"
brew "postgresql"
brew "starship"
brew "sqlite"
brew "tfenv"
brew "thefuck"
brew "vim"
brew "wget"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
